---
kind: method
id: M:Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Apply(System.String)
source: html/cd4d27bf-7a2d-99f1-55de-1d4a6c5a6d01.htm
---
# Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Apply Method

Applies formula to the parameter

## Syntax (C#)
```csharp
public void Apply(
	string formula
)
```

## Parameters
- **formula** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null